## Necessary Modules

In [1]:
#(** To avoid error ,first uninstall the modules if exists from before. Then install again.)
#pip3 install mysql-connector-python
# pip3 install mysqlclient
# pip3 install ipython-sql
# pip3 install mypy-extensions
# pip3 install SQLAlchemy
# pip3 install PyMySQL

## Creating a database and connecting to it

In [1]:
#Connecting to MySQL database
import mysql.connector as sql
mydb=sql.connect(host="localhost",user="root",passwd="Mahmud")
mycursor = mydb.cursor()

In [5]:
#Creating a database
mycursor.execute("CREATE DATABASE Problem_set_01")

In [4]:
#Deleting the database
#mycursor.execute("DROP DATABASE Problem_set_01")

In [2]:
%load_ext sql

In [3]:
#Connecting to the database which was created before
%sql mysql://root:Mahmud@localhost/Problem_set_01

## Schema

![Cat](images/Problem_set_01.png)

## Creating necessary table

In [21]:
%%sql
create table CITY (
    ID INTEGER,
    NAME VARCHAR(17),
    COUNTRYCODE VARCHAR(3),
    DISTRICT VARCHAR(20),
    POPULATION INTEGER);

 * mysql://root:***@localhost/Problem_set_01
0 rows affected.

[]

In [4]:
%sql desc CITY;

 * mysql://root:***@localhost/Problem_set_01
5 rows affected.

[('ID', 'int', 'YES', '', None, ''),
 ('NAME', 'varchar(17)', 'YES', '', None, ''),
 ('COUNTRYCODE', 'varchar(3)', 'YES', '', None, ''),
 ('DISTRICT', 'varchar(20)', 'YES', '', None, ''),
 ('POPULATION', 'int', 'YES', '', None, '')]

In [20]:
# %%sql
# drop table CITY;

 * mysql://root:***@localhost/Problem_set_01
0 rows affected.

[]

## Loading data to the table

In [8]:
%%sql
load data infile "C:/ProgramData/MySQL/MySQL Server 8.0/Uploads/Problem_set_01.csv"
  into table CITY
    fields terminated by ","
      enclosed by '"'
        lines terminated by '\n'
          ignore 1 rows;

 * mysql://root:***@localhost/Problem_set_01
83 rows affected.

[]

In [33]:
%%sql
select * from CITY limit 5;

 * mysql://root:***@localhost/Problem_set_01
5 rows affected.

[(6, 'Rotterdam', 'NLD', 'Zuid-Holland', 593321),
 (19, 'Zaanstad', 'NLD', 'Noord-Holland', 135621),
 (214, 'Porto Alegre', 'BRA', 'Rio Grande do Sul', 1314032),
 (397, 'Lauro de Freitas', 'BRA', 'Bahia', 109236),
 (547, 'Dobric', 'BGR', 'Varna', 100399)]

### Problem 1:	Query all columns for all American cities in the CITY table with populations larger than 100000. The CountryCode for America is USA.

In [5]:
%%sql
select * from CITY
  where COUNTRYCODE="USA" && POPULATION>100000;

 * mysql://root:***@localhost/Problem_set_01
6 rows affected.

[(3815, 'El Paso', 'USA', 'Texas', 563662),
 (3878, 'Scottsdale', 'USA', 'Arizona', 202705),
 (3965, 'Corona', 'USA', 'California', 124966),
 (3973, 'Concord', 'USA', 'California', 121780),
 (3977, 'Cedar Rapids', 'USA', 'Iowa', 120758),
 (3982, 'Coral Springs', 'USA', 'Florida', 117549)]

### Problem 2:	Query the NAME field for all American cities in the CITY table with populations larger than 120000. The CountryCode for America is USA.

In [6]:
%%sql
select NAME from CITY
  where COUNTRYCODE="USA" and POPULATION>120000;

 * mysql://root:***@localhost/Problem_set_01
5 rows affected.

[('El Paso',), ('Scottsdale',), ('Corona',), ('Concord',), ('Cedar Rapids',)]

### Problem 3:	Query all columns for a city in CITY with the ID 1661.

In [7]:
%%sql
select * from CITY
  where ID=1661;

 * mysql://root:***@localhost/Problem_set_01
1 rows affected.

[(1661, 'Sayama', 'JPN', 'Saitama', 162472)]

### Problem 4: Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

In [8]:
%%sql
select * from CITY
  where COUNTRYCODE="JPN";

 * mysql://root:***@localhost/Problem_set_01
5 rows affected.

[(1613, 'Neyagawa', 'JPN', 'Osaka', 257315),
 (1630, 'Ageo', 'JPN', 'Saitama', 209442),
 (1661, 'Sayama', 'JPN', 'Saitama', 162472),
 (1681, 'Omuta', 'JPN', 'Fukuoka', 142889),
 (1739, 'Tokuyama', 'JPN', 'Yamaguchi', 107078)]

### Problem 5:	Query the names and populations of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.

In [9]:
%%sql
select NAME,POPULATION from CITY
  where COUNTRYCODE="JPN";

 * mysql://root:***@localhost/Problem_set_01
5 rows affected.

[('Neyagawa', 257315),
 ('Ageo', 209442),
 ('Sayama', 162472),
 ('Omuta', 142889),
 ('Tokuyama', 107078)]

### Problem 6:	Query a count of the number of cities in CITY having a Population larger than 100,000.

In [21]:
%%sql
select count(distinct(ID)) as "NUMBER OF CITIES" from CITY
  where POPULATION>100000;

 * mysql://root:***@localhost/Problem_set_01
1 rows affected.

[(68,)]

### Problem 7: Query the total population of all cities in CITY where District is California.

In [24]:
%%sql
select sum(POPULATION) as "POPULATION OF CALIFORNIA"
  from CITY
    where DISTRICT="California";

 * mysql://root:***@localhost/Problem_set_01
1 rows affected.

[(Decimal('339002'),)]

### Problem 8:	Query the average population of all cities in CITY where District is California.

In [25]:
%%sql
select avg(POPULATION) as "AVERAGE POPULATION OF CALIFORNIA"
  from CITY
    where DISTRICT="California";

 * mysql://root:***@localhost/Problem_set_01
1 rows affected.

[(Decimal('113000.6667'),)]

### Problem 9:	Query the average population for all cities in CITY, rounded down to the nearest integer.

In [28]:
%%sql
select round(avg(POPULATION)) as "AVERAGE POPULATION"
  from CITY;

 * mysql://root:***@localhost/Problem_set_01
1 rows affected.

[(Decimal('454250'),)]

### Problem 10:	Query the sum of the populations for all Japanese cities in CITY. The COUNTRYCODE for Japan is JPN.

In [29]:
%%sql
select sum(POPULATION) as "POPULATION OF JAPAN"
  from CITY
    where COUNTRYCODE="JPN";

 * mysql://root:***@localhost/Problem_set_01
1 rows affected.

[(Decimal('879196'),)]

### Problem 11:	Query the difference between the maximum and minimum populations in CITY.

In [30]:
%%sql
select max(POPULATION)-min(POPULATION) as "DIFFERENCE"
  from CITY;

 * mysql://root:***@localhost/Problem_set_01
1 rows affected.

[(4695354,)]